Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/iMXRT1021/fsl_iomuxc.h
/*
 * Copyright 2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_IOMUXC_H_
#define _FSL_IOMUXC_H_

#include "fsl_common.h"

/*!
 * @addtogroup iomuxc_driver
 * @{
 */

/*! @file */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.iomuxc"
#endif

/*! @name Driver version */
/*@{*/
/*! @brief IOMUXC driver version 2.0.2. */
#define FSL_IOMUXC_DRIVER_VERSION (MAKE_VERSION(2, 0, 2))
/*@}*/

/*!
 * @name Pin function ID
 * The pin function ID is a tuple of \<muxRegister muxMode inputRegister inputDaisy configRegister\>
 *
 * @{
 */
#define IOMUXC_GPIO_EMC_00_SEMC_DATA00            0x401F8014U, 0x0U, 0, 0, 0x401F8188U
#define IOMUXC_GPIO_EMC_00_QTIMER2_TIMER0         0x401F8014U, 0x1U, 0x401F8420U, 0x0U, 0x401F8188U
#define IOMUXC_GPIO_EMC_00_LPUART4_CTS_B          0x401F8014U, 0x2U, 0x401F83E0U, 0x0U, 0x401F8188U
#define IOMUXC_GPIO_EMC_00_SPDIF_SR_CLK           0x401F8014U, 0x3U, 0, 0, 0x401F8188U
#define IOMUXC_GPIO_EMC_00_LPSPI2_SCK             0x401F8014U, 0x4U, 0, 0, 0x401F8188U
#define IOMUXC_GPIO_EMC_00_GPIO2_IO00             0x401F8014U, 0x5U, 0, 0, 0x401F8188U
#define IOMUXC_GPIO_EMC_00_FLEXCAN1_TX            0x401F8014U, 0x6U, 0, 0, 0x401F8188U
#define IOMUXC_GPIO_EMC_00_PIT_TRIGGER02          0x401F8014U, 0x7U, 0, 0, 0x401F8188U

#define IOMUXC_GPIO_EMC_01_SEMC_DATA01            0x401F8018U, 0x0U, 0, 0, 0x401F818CU
#define IOMUXC_GPIO_EMC_01_QTIMER2_TIMER1         0x401F8018U, 0x1U, 0x401F8424U, 0x0U, 0x401F818CU
#define IOMUXC_GPIO_EMC_01_LPUART4_RTS_B          0x401F8018U, 0x2U, 0, 0, 0x401F818CU
#define IOMUXC_GPIO_EMC_01_SPDIF_OUT              0x401F8018U, 0x3U, 0, 0, 0x401F818CU
#define IOMUXC_GPIO_EMC_01_LPSPI2_PCS0            0x401F8018U, 0x4U, 0x401F83ACU, 0x0U, 0x401F818CU
#define IOMUXC_GPIO_EMC_01_GPIO2_IO01             0x401F8018U, 0x5U, 0, 0, 0x401F818CU
#define IOMUXC_GPIO_EMC_01_FLEXCAN1_RX            0x401F8018U, 0x6U, 0x401F8320U, 0x0U, 0x401F818CU
#define IOMUXC_GPIO_EMC_01_PIT_TRIGGER03          0x401F8018U, 0x7U, 0, 0, 0x401F818CU

#define IOMUXC_GPIO_EMC_02_SEMC_DATA02            0x401F801CU, 0x0U, 0, 0, 0x401F8190U
#define IOMUXC_GPIO_EMC_02_QTIMER2_TIMER2         0x401F801CU, 0x1U, 0x401F8428U, 0x0U, 0x401F8190U
#define IOMUXC_GPIO_EMC_02_LPUART4_TX             0x401F801CU, 0x2U, 0x401F83E8U, 0x0U, 0x401F8190U
#define IOMUXC_GPIO_EMC_02_SPDIF_LOCK             0x401F801CU, 0x3U, 0, 0, 0x401F8190U
#define IOMUXC_GPIO_EMC_02_LPSPI2_SDO             0x401F801CU, 0x4U, 0x401F83B8U, 0x0U, 0x401F8190U
#define IOMUXC_GPIO_EMC_02_GPIO2_IO02             0x401F801CU, 0x5U, 0, 0, 0x401F8190U
#define IOMUXC_GPIO_EMC_02_LPI2C1_SCL             0x401F801CU, 0x6U, 0x401F837CU, 0x0U, 0x401F8190U

#define IOMUXC_GPIO_EMC_03_SEMC_DATA03            0x401F8020U, 0x0U, 0, 0, 0x401F8194U
#define IOMUXC_GPIO_EMC_03_QTIMER2_TIMER3         0x401F8020U, 0x1U, 0x401F842CU, 0x0U, 0x401F8194U
#define IOMUXC_GPIO_EMC_03_LPUART4_RX             0x401F8020U, 0x2U, 0x401F83E4U, 0x0U, 0x401F8194U
#define IOMUXC_GPIO_EMC_03_SPDIF_EXT_CLK          0x401F8020U, 0x3U, 0, 0, 0x401F8194U
#define IOMUXC_GPIO_EMC_03_LPSPI2_SDI             0x401F8020U, 0x4U, 0x401F83B4U, 0x0U, 0x401F8194U
#define IOMUXC_GPIO_EMC_03_GPIO2_IO03             0x401F8020U, 0x5U, 0, 0, 0x401F8194U
#define IOMUXC_GPIO_EMC_03_LPI2C1_SDA             0x401F8020U, 0x6U, 0x401F8380U, 0x0U, 0x401F8194U

#define IOMUXC_GPIO_EMC_04_SEMC_DATA04            0x401F8024U, 0x0U, 0, 0, 0x401F8198U
#define IOMUXC_GPIO_EMC_04_XBAR1_INOUT04          0x401F8024U, 0x1U, 0, 0, 0x401F8198U
#define IOMUXC_GPIO_EMC_04_SPDIF_OUT              0x401F8024U, 0x2U, 0, 0, 0x401F8198U
#define IOMUXC_GPIO_EMC_04_SAI2_TX_BCLK           0x401F8024U, 0x3U, 0x401F8464U, 0x1U, 0x401F8198U
#define IOMUXC_GPIO_EMC_04_FLEXIO1_FLEXIO16       0x401F8024U, 0x4U, 0, 0, 0x401F8198U
#define IOMUXC_GPIO_EMC_04_GPIO2_IO04             0x401F8024U, 0x5U, 0, 0, 0x401F8198U

#define IOMUXC_GPIO_EMC_05_SEMC_DATA05            0x401F8028U, 0x0U, 0, 0, 0x401F819CU
#define IOMUXC_GPIO_EMC_05_XBAR1_INOUT05          0x401F8028U, 0x1U, 0, 0, 0x401F819CU
#define IOMUXC_GPIO_EMC_05_SPDIF_IN               0x401F8028U, 0x2U, 0x401F8488U, 0x0U, 0x401F819CU
#define IOMUXC_GPIO_EMC_05_SAI2_TX_SYNC           0x401F8028U, 0x3U, 0x401F8468U, 0x1U, 0x401F819CU
#define IOMUXC_GPIO_EMC_05_FLEXIO1_FLEXIO17       0x401F8028U, 0x4U, 0, 0, 0x401F819CU
#define IOMUXC_GPIO_EMC_05_GPIO2_IO05             0x401F8028U, 0x5U, 0, 0, 0x401F819CU

#define IOMUXC_GPIO_EMC_06_SEMC_DATA06            0x401F802CU, 0x0U, 0, 0, 0x401F81A0U
#define IOMUXC_GPIO_EMC_06_XBAR1_INOUT06          0x401F802CU, 0x1U, 0, 0, 0x401F81A0U
#define IOMUXC_GPIO_EMC_06_LPUART3_TX             0x401F802CU, 0x2U, 0x401F83DCU, 0x0U, 0x401F81A0U
#define IOMUXC_GPIO_EMC_06_SAI2_TX_DATA           0x401F802CU, 0x3U, 0, 0, 0x401F81A0U
#define IOMUXC_GPIO_EMC_06_FLEXIO1_FLEXIO18       0x401F802CU, 0x4U, 0, 0, 0x401F81A0U
#define IOMUXC_GPIO_EMC_06_GPIO2_IO06             0x401F802CU, 0x5U, 0, 0, 0x401F81A0U

#define IOMUXC_GPIO_EMC_07_SEMC_DATA07            0x401F8030U, 0x0U, 0, 0, 0x401F81A4U
#define IOMUXC_GPIO_EMC_07_XBAR1_INOUT07          0x401F8030U, 0x1U, 0, 0, 0x401F81A4U
#define IOMUXC_GPIO_EMC_07_LPUART3_RX             0x401F8030U, 0x2U, 0x401F83D8U, 0x0U, 0x401F81A4U
#define IOMUXC_GPIO_EMC_07_SAI2_RX_SYNC           0x401F8030U, 0x3U, 0x401F8460U, 0x1U, 0x401F81A4U
#define IOMUXC_GPIO_EMC_07_FLEXIO1_FLEXIO19       0x401F8030U, 0x4U, 0, 0, 0x401F81A4U
#define IOMUXC_GPIO_EMC_07_GPIO2_IO07             0x401F8030U, 0x5U, 0, 0, 0x401F81A4U

#define IOMUXC_GPIO_EMC_08_SEMC_DM00              0x401F8034U, 0x0U, 0, 0, 0x401F81A8U
#define IOMUXC_GPIO_EMC_08_XBAR1_INOUT08          0x401F8034U, 0x1U, 0, 0, 0x401F81A8U
#define IOMUXC_GPIO_EMC_08_FLEXCAN2_TX            0x401F8034U, 0x2U, 0, 0, 0x401F81A8U
#define IOMUXC_GPIO_EMC_08_SAI2_RX_DATA           0x401F8034U, 0x3U, 0x401F845CU, 0x1U, 0x401F81A8U
#define IOMUXC_GPIO_EMC_08_FLEXIO1_FLEXIO20       0x401F8034U, 0x4U, 0, 0, 0x401F81A8U
#define IOMUXC_GPIO_EMC_08_GPIO2_IO08             0x401F8034U, 0x5U, 0, 0, 0x401F81A8U

#define IOMUXC_GPIO_EMC_09_SEMC_WE                0x401F8038U, 0x0U, 0, 0, 0x401F81ACU
#define IOMUXC_GPIO_EMC_09_XBAR1_INOUT09          0x401F8038U, 0x1U, 0, 0, 0x401F81ACU
#define IOMUXC_GPIO_EMC_09_FLEXCAN2_RX            0x401F8038U, 0x2U, 0x401F8324U, 0x1U, 0x401F81ACU
#define IOMUXC_GPIO_EMC_09_SAI2_RX_BCLK           0x401F8038U, 0x3U, 0x401F8458U, 0x1U, 0x401F81ACU
#define IOMUXC_GPIO_EMC_09_FLEXIO1_FLEXIO21       0x401F8038U, 0x4U, 0, 0, 0x401F81ACU
#define IOMUXC_GPIO_EMC_09_GPIO2_IO09             0x401F8038U, 0x5U, 0, 0, 0x401F81ACU

#define IOMUXC_GPIO_EMC_10_SEMC_CAS               0x401F803CU, 0x0U, 0, 0, 0x401F81B0U
#define IOMUXC_GPIO_EMC_10_XBAR1_INOUT10          0x401F803CU, 0x1U, 0x401F84B0U, 0x0U, 0x401F81B0U
#define IOMUXC_GPIO_EMC_10_LPI2C4_SDA             0x401F803CU, 0x2U, 0x401F8398U, 0x0U, 0x401F81B0U
#define IOMUXC_GPIO_EMC_10_SAI1_TX_SYNC           0x401F803CU, 0x3U, 0x401F8450U, 0x0U, 0x401F81B0U
#define IOMUXC_GPIO_EMC_10_LPSPI2_SCK             0x401F803CU, 0x4U, 0, 0, 0x401F81B0U
#define IOMUXC_GPIO_EMC_10_GPIO2_IO10             0x401F803CU, 0x5U, 0, 0, 0x401F81B0U
#define IOMUXC_GPIO_EMC_10_FLEXPWM2_PWMX00        0x401F803CU, 0x6U, 0, 0, 0x401F81B0U

#define IOMUXC_GPIO_EMC_11_SEMC_RAS               0x401F8040U, 0x0U, 0, 0, 0x401F81B4U
#define IOMUXC_GPIO_EMC_11_XBAR1_INOUT11          0x401F8040U, 0x1U, 0, 0, 0x401F81B4U
#define IOMUXC_GPIO_EMC_11_LPI2C4_SCL             0x401F8040U, 0x2U, 0x401F8394U, 0x0U, 0x401F81B4U
#define IOMUXC_GPIO_EMC_11_SAI1_TX_BCLK           0x401F8040U, 0x3U, 0x401F844CU, 0x0U, 0x401F81B4U
#define IOMUXC_GPIO_EMC_11_LPSPI2_PCS0            0x401F8040U, 0x4U, 0x401F83ACU, 0x1U, 0x401F81B4U
#define IOMUXC_GPIO_EMC_11_GPIO2_IO11             0x401F8040U, 0x5U, 0, 0, 0x401F81B4U
#define IOMUXC_GPIO_EMC_11_FLEXPWM2_PWMX01        0x401F8040U, 0x6U, 0, 0, 0x401F81B4U

#define IOMUXC_GPIO_EMC_12_SEMC_CS0               0x401F8044U, 0x0U, 0, 0, 0x401F81B8U
#define IOMUXC_GPIO_EMC_12_XBAR1_INOUT12          0x401F8044U, 0x1U, 0x401F84B4U, 0x0U, 0x401F81B8U
#define IOMUXC_GPIO_EMC_12_LPUART6_TX             0x401F8044U, 0x2U, 0x401F83F8U, 0x0U, 0x401F81B8U
#define IOMUXC_GPIO_EMC_12_SAI1_TX_DATA00         0x401F8044U, 0x3U, 0, 0, 0x401F81B8U
#define IOMUXC_GPIO_EMC_12_LPSPI2_SDO             0x401F8044U, 0x4U, 0x401F83B8U, 0x1U, 0x401F81B8U
#define IOMUXC_GPIO_EMC_12_GPIO2_IO12             0x401F8044U, 0x5U, 0, 0, 0x401F81B8U
#define IOMUXC_GPIO_EMC_12_FLEXPWM2_PWMX02        0x401F8044U, 0x6U, 0, 0, 0x401F81B8U

#define IOMUXC_GPIO_EMC_13_SEMC_BA0               0x401F8048U, 0x0U, 0, 0, 0x401F81BCU
#define IOMUXC_GPIO_EMC_13_XBAR1_INOUT13          0x401F8048U, 0x1U, 0x401F84B8U, 0x0U, 0x401F81BCU
#define IOMUXC_GPIO_EMC_13_LPUART6_RX             0x401F8048U, 0x2U, 0x401F83F4U, 0x0U, 0x401F81BCU
#define IOMUXC_GPIO_EMC_13_SAI1_RX_DATA00         0x401F8048U, 0x3U, 0x401F8438U, 0x0U, 0x401F81BCU
#define IOMUXC_GPIO_EMC_13_LPSPI2_SDI             0x401F8048U, 0x4U, 0x401F83B4U, 0x1U, 0x401F81BCU
#define IOMUXC_GPIO_EMC_13_GPIO2_IO13             0x401F8048U, 0x5U, 0, 0, 0x401F81BCU
#define IOMUXC_GPIO_EMC_13_FLEXPWM2_PWMX03        0x401F8048U, 0x6U, 0, 0, 0x401F81BCU
#define IOMUXC_GPIO_EMC_13_CCM_PMIC_RDY           0x401F8048U, 0x7U, 0x401F8300U, 0x0U, 0x401F81BCU

#define IOMUXC_GPIO_EMC_14_SEMC_BA1               0x401F804CU, 0x0U, 0, 0, 0x401F81C0U
#define IOMUXC_GPIO_EMC_14_XBAR1_INOUT14          0x401F804CU, 0x1U, 0x401F84A0U, 0x1U, 0x401F81C0U
#define IOMUXC_GPIO_EMC_14_LPUART6_CTS_B          0x401F804CU, 0x2U, 0, 0, 0x401F81C0U
#define IOMUXC_GPIO_EMC_14_SAI1_RX_BCLK           0x401F804CU, 0x3U, 0x401F8434U, 0x1U, 0x401F81C0U
#define IOMUXC_GPIO_EMC_14_LPSPI2_PCS1            0x401F804CU, 0x4U, 0, 0, 0x401F81C0U
#define IOMUXC_GPIO_EMC_14_GPIO2_IO14             0x401F804CU, 0x5U, 0, 0, 0x401F81C0U
#define IOMUXC_GPIO_EMC_14_FLEXCAN1_TX            0x401F804CU, 0x6U, 0, 0, 0x401F81C0U

#define IOMUXC_GPIO_EMC_15_SEMC_ADDR10            0x401F8050U, 0x0U, 0, 0, 0x401F81C4U
#define IOMUXC_GPIO_EMC_15_XBAR1_INOUT15          0x401F8050U, 0x1U, 0x401F84A4U, 0x1U, 0x401F81C4U
#define IOMUXC_GPIO_EMC_15_LPUART6_RTS_B          0x401F8050U, 0x2U, 0, 0, 0x401F81C4U
#define IOMUXC_GPIO_EMC_15_SAI1_RX_SYNC           0x401F8050U, 0x3U, 0x401F8448U, 0x1U, 0x401F81C4U
#define IOMUXC_GPIO_EMC_15_WDOG1_B                0x401F8050U, 0x4U, 0, 0, 0x401F81C4U
#define IOMUXC_GPIO_EMC_15_GPIO2_IO15             0x401F8050U, 0x5U, 0, 0, 0x401F81C4U
#define IOMUXC_GPIO_EMC_15_FLEXCAN1_RX            0x401F8050U, 0x6U, 0x401F8320U, 0x3U, 0x401F81C4U

#define IOMUXC_GPIO_EMC_16_SEMC_ADDR00            0x401F8054U, 0x0U, 0, 0, 0x401F81C8U
#define IOMUXC_GPIO_EMC_16_MQS_RIGHT              0x401F8054U, 0x2U, 0, 0, 0x401F81C8U
#define IOMUXC_GPIO_EMC_16_SAI2_MCLK              0x401F8054U, 0x3U, 0x401F8454U, 0x1U, 0x401F81C8U
#define IOMUXC_GPIO_EMC_16_GPIO2_IO16             0x401F8054U, 0x5U, 0, 0, 0x401F81C8U
#define IOMUXC_GPIO_EMC_16_SRC_BOOT_MODE00        0x401F8054U, 0x6U, 0, 0, 0x401F81C8U

