Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/iMXRT1021/fsl_iomuxc.h
#define IOMUXC_GPIO_EMC_17_SEMC_ADDR01            0x401F8058U, 0x0U, 0, 0, 0x401F81CCU
#define IOMUXC_GPIO_EMC_17_MQS_LEFT               0x401F8058U, 0x2U, 0, 0, 0x401F81CCU
#define IOMUXC_GPIO_EMC_17_SAI3_MCLK              0x401F8058U, 0x3U, 0x401F846CU, 0x1U, 0x401F81CCU
#define IOMUXC_GPIO_EMC_17_GPIO2_IO17             0x401F8058U, 0x5U, 0, 0, 0x401F81CCU
#define IOMUXC_GPIO_EMC_17_SRC_BOOT_MODE01        0x401F8058U, 0x6U, 0, 0, 0x401F81CCU

#define IOMUXC_GPIO_EMC_18_SEMC_ADDR02            0x401F805CU, 0x0U, 0, 0, 0x401F81D0U
#define IOMUXC_GPIO_EMC_18_XBAR1_INOUT16          0x401F805CU, 0x1U, 0x401F84A8U, 0x1U, 0x401F81D0U
#define IOMUXC_GPIO_EMC_18_LPI2C2_SDA             0x401F805CU, 0x2U, 0x401F8388U, 0x1U, 0x401F81D0U
#define IOMUXC_GPIO_EMC_18_SAI1_RX_SYNC           0x401F805CU, 0x3U, 0x401F8448U, 0x2U, 0x401F81D0U
#define IOMUXC_GPIO_EMC_18_FLEXIO1_FLEXIO22       0x401F805CU, 0x4U, 0, 0, 0x401F81D0U
#define IOMUXC_GPIO_EMC_18_GPIO2_IO18             0x401F805CU, 0x5U, 0, 0, 0x401F81D0U
#define IOMUXC_GPIO_EMC_18_SRC_BT_CFG00           0x401F805CU, 0x6U, 0, 0, 0x401F81D0U

#define IOMUXC_GPIO_EMC_19_SEMC_ADDR03            0x401F8060U, 0x0U, 0, 0, 0x401F81D4U
#define IOMUXC_GPIO_EMC_19_XBAR1_INOUT17          0x401F8060U, 0x1U, 0x401F84ACU, 0x1U, 0x401F81D4U
#define IOMUXC_GPIO_EMC_19_LPI2C2_SCL             0x401F8060U, 0x2U, 0x401F8384U, 0x1U, 0x401F81D4U
#define IOMUXC_GPIO_EMC_19_SAI1_RX_BCLK           0x401F8060U, 0x3U, 0x401F8434U, 0x2U, 0x401F81D4U
#define IOMUXC_GPIO_EMC_19_FLEXIO1_FLEXIO23       0x401F8060U, 0x4U, 0, 0, 0x401F81D4U
#define IOMUXC_GPIO_EMC_19_GPIO2_IO19             0x401F8060U, 0x5U, 0, 0, 0x401F81D4U
#define IOMUXC_GPIO_EMC_19_SRC_BT_CFG01           0x401F8060U, 0x6U, 0, 0, 0x401F81D4U

#define IOMUXC_GPIO_EMC_20_SEMC_ADDR04            0x401F8064U, 0x0U, 0, 0, 0x401F81D8U
#define IOMUXC_GPIO_EMC_20_FLEXPWM1_PWMA03        0x401F8064U, 0x1U, 0x401F8334U, 0x1U, 0x401F81D8U
#define IOMUXC_GPIO_EMC_20_LPUART2_CTS_B          0x401F8064U, 0x2U, 0x401F83CCU, 0x1U, 0x401F81D8U
#define IOMUXC_GPIO_EMC_20_SAI1_MCLK              0x401F8064U, 0x3U, 0x401F8430U, 0x3U, 0x401F81D8U
#define IOMUXC_GPIO_EMC_20_FLEXIO1_FLEXIO24       0x401F8064U, 0x4U, 0, 0, 0x401F81D8U
#define IOMUXC_GPIO_EMC_20_GPIO2_IO20             0x401F8064U, 0x5U, 0, 0, 0x401F81D8U
#define IOMUXC_GPIO_EMC_20_SRC_BT_CFG02           0x401F8064U, 0x6U, 0, 0, 0x401F81D8U

#define IOMUXC_GPIO_EMC_21_SEMC_ADDR05            0x401F8068U, 0x0U, 0, 0, 0x401F81DCU
#define IOMUXC_GPIO_EMC_21_FLEXPWM1_PWMB03        0x401F8068U, 0x1U, 0x401F8344U, 0x1U, 0x401F81DCU
#define IOMUXC_GPIO_EMC_21_LPUART2_RTS_B          0x401F8068U, 0x2U, 0, 0, 0x401F81DCU
#define IOMUXC_GPIO_EMC_21_SAI1_RX_DATA00         0x401F8068U, 0x3U, 0x401F8438U, 0x2U, 0x401F81DCU
#define IOMUXC_GPIO_EMC_21_FLEXIO1_FLEXIO25       0x401F8068U, 0x4U, 0, 0, 0x401F81DCU
#define IOMUXC_GPIO_EMC_21_GPIO2_IO21             0x401F8068U, 0x5U, 0, 0, 0x401F81DCU
#define IOMUXC_GPIO_EMC_21_SRC_BT_CFG03           0x401F8068U, 0x6U, 0, 0, 0x401F81DCU

#define IOMUXC_GPIO_EMC_22_SEMC_ADDR06            0x401F806CU, 0x0U, 0, 0, 0x401F81E0U
#define IOMUXC_GPIO_EMC_22_FLEXPWM1_PWMA02        0x401F806CU, 0x1U, 0x401F8330U, 0x1U, 0x401F81E0U
#define IOMUXC_GPIO_EMC_22_LPUART2_TX             0x401F806CU, 0x2U, 0x401F83D4U, 0x1U, 0x401F81E0U
#define IOMUXC_GPIO_EMC_22_SAI1_TX_DATA03         0x401F806CU, 0x3U, 0x401F843CU, 0x1U, 0x401F81E0U
#define IOMUXC_GPIO_EMC_22_FLEXIO1_FLEXIO26       0x401F806CU, 0x4U, 0, 0, 0x401F81E0U
#define IOMUXC_GPIO_EMC_22_GPIO2_IO22             0x401F806CU, 0x5U, 0, 0, 0x401F81E0U
#define IOMUXC_GPIO_EMC_22_SRC_BT_CFG04           0x401F806CU, 0x6U, 0, 0, 0x401F81E0U

#define IOMUXC_GPIO_EMC_23_SEMC_ADDR07            0x401F8070U, 0x0U, 0, 0, 0x401F81E4U
#define IOMUXC_GPIO_EMC_23_FLEXPWM1_PWMB02        0x401F8070U, 0x1U, 0x401F8340U, 0x1U, 0x401F81E4U
#define IOMUXC_GPIO_EMC_23_LPUART2_RX             0x401F8070U, 0x2U, 0x401F83D0U, 0x1U, 0x401F81E4U
#define IOMUXC_GPIO_EMC_23_SAI1_TX_DATA02         0x401F8070U, 0x3U, 0x401F8440U, 0x1U, 0x401F81E4U
#define IOMUXC_GPIO_EMC_23_FLEXIO1_FLEXIO27       0x401F8070U, 0x4U, 0, 0, 0x401F81E4U
#define IOMUXC_GPIO_EMC_23_GPIO2_IO23             0x401F8070U, 0x5U, 0, 0, 0x401F81E4U
#define IOMUXC_GPIO_EMC_23_SRC_BT_CFG05           0x401F8070U, 0x6U, 0, 0, 0x401F81E4U

#define IOMUXC_GPIO_EMC_24_SEMC_ADDR08            0x401F8074U, 0x0U, 0, 0, 0x401F81E8U
#define IOMUXC_GPIO_EMC_24_FLEXPWM1_PWMA01        0x401F8074U, 0x1U, 0x401F832CU, 0x1U, 0x401F81E8U
#define IOMUXC_GPIO_EMC_24_LPUART8_CTS_B          0x401F8074U, 0x2U, 0, 0, 0x401F81E8U
#define IOMUXC_GPIO_EMC_24_SAI1_TX_DATA01         0x401F8074U, 0x3U, 0x401F8444U, 0x1U, 0x401F81E8U
#define IOMUXC_GPIO_EMC_24_FLEXIO1_FLEXIO28       0x401F8074U, 0x4U, 0, 0, 0x401F81E8U
#define IOMUXC_GPIO_EMC_24_GPIO2_IO24             0x401F8074U, 0x5U, 0, 0, 0x401F81E8U
#define IOMUXC_GPIO_EMC_24_SRC_BT_CFG06           0x401F8074U, 0x6U, 0, 0, 0x401F81E8U

#define IOMUXC_GPIO_EMC_25_SEMC_ADDR09            0x401F8078U, 0x0U, 0, 0, 0x401F81ECU
#define IOMUXC_GPIO_EMC_25_FLEXPWM1_PWMB01        0x401F8078U, 0x1U, 0x401F833CU, 0x1U, 0x401F81ECU
#define IOMUXC_GPIO_EMC_25_LPUART8_RTS_B          0x401F8078U, 0x2U, 0, 0, 0x401F81ECU
#define IOMUXC_GPIO_EMC_25_SAI1_TX_DATA00         0x401F8078U, 0x3U, 0, 0, 0x401F81ECU
#define IOMUXC_GPIO_EMC_25_FLEXIO1_FLEXIO29       0x401F8078U, 0x4U, 0, 0, 0x401F81ECU
#define IOMUXC_GPIO_EMC_25_GPIO2_IO25             0x401F8078U, 0x5U, 0, 0, 0x401F81ECU
#define IOMUXC_GPIO_EMC_25_SRC_BT_CFG07           0x401F8078U, 0x6U, 0, 0, 0x401F81ECU

#define IOMUXC_GPIO_EMC_26_SEMC_ADDR11            0x401F807CU, 0x0U, 0, 0, 0x401F81F0U
#define IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMA00        0x401F807CU, 0x1U, 0x401F8328U, 0x1U, 0x401F81F0U
#define IOMUXC_GPIO_EMC_26_LPUART8_TX             0x401F807CU, 0x2U, 0x401F8408U, 0x1U, 0x401F81F0U
#define IOMUXC_GPIO_EMC_26_SAI1_TX_BCLK           0x401F807CU, 0x3U, 0x401F844CU, 0x2U, 0x401F81F0U
#define IOMUXC_GPIO_EMC_26_FLEXIO1_FLEXIO30       0x401F807CU, 0x4U, 0, 0, 0x401F81F0U
#define IOMUXC_GPIO_EMC_26_GPIO2_IO26             0x401F807CU, 0x5U, 0, 0, 0x401F81F0U
#define IOMUXC_GPIO_EMC_26_SRC_BT_CFG08           0x401F807CU, 0x6U, 0, 0, 0x401F81F0U

#define IOMUXC_GPIO_EMC_27_SEMC_ADDR12            0x401F8080U, 0x0U, 0, 0, 0x401F81F4U
#define IOMUXC_GPIO_EMC_27_FLEXPWM1_PWMB00        0x401F8080U, 0x1U, 0x401F8338U, 0x1U, 0x401F81F4U
#define IOMUXC_GPIO_EMC_27_LPUART8_RX             0x401F8080U, 0x2U, 0x401F8404U, 0x1U, 0x401F81F4U
#define IOMUXC_GPIO_EMC_27_SAI1_TX_SYNC           0x401F8080U, 0x3U, 0x401F8450U, 0x2U, 0x401F81F4U
#define IOMUXC_GPIO_EMC_27_FLEXIO1_FLEXIO31       0x401F8080U, 0x4U, 0, 0, 0x401F81F4U
#define IOMUXC_GPIO_EMC_27_GPIO2_IO27             0x401F8080U, 0x5U, 0, 0, 0x401F81F4U
#define IOMUXC_GPIO_EMC_27_SRC_BT_CFG09           0x401F8080U, 0x6U, 0, 0, 0x401F81F4U

#define IOMUXC_GPIO_EMC_28_SEMC_DQS               0x401F8084U, 0x0U, 0, 0, 0x401F81F8U
#define IOMUXC_GPIO_EMC_28_FLEXPWM2_PWMA03        0x401F8084U, 0x1U, 0x401F8354U, 0x1U, 0x401F81F8U
#define IOMUXC_GPIO_EMC_28_XBAR1_INOUT18          0x401F8084U, 0x2U, 0x401F84BCU, 0x0U, 0x401F81F8U
#define IOMUXC_GPIO_EMC_28_SAI3_MCLK              0x401F8084U, 0x3U, 0x401F846CU, 0x2U, 0x401F81F8U
#define IOMUXC_GPIO_EMC_28_EWM_OUT_B              0x401F8084U, 0x4U, 0, 0, 0x401F81F8U
#define IOMUXC_GPIO_EMC_28_GPIO2_IO28             0x401F8084U, 0x5U, 0, 0, 0x401F81F8U
#define IOMUXC_GPIO_EMC_28_GPT2_CAPTURE2          0x401F8084U, 0x6U, 0, 0, 0x401F81F8U
#define IOMUXC_GPIO_EMC_28_FLEXPWM1_PWMX00        0x401F8084U, 0x7U, 0, 0, 0x401F81F8U

#define IOMUXC_GPIO_EMC_29_SEMC_CKE               0x401F8088U, 0x0U, 0, 0, 0x401F81FCU
#define IOMUXC_GPIO_EMC_29_FLEXPWM2_PWMB03        0x401F8088U, 0x1U, 0x401F8364U, 0x1U, 0x401F81FCU
#define IOMUXC_GPIO_EMC_29_XBAR1_INOUT19          0x401F8088U, 0x2U, 0x401F84C0U, 0x0U, 0x401F81FCU
#define IOMUXC_GPIO_EMC_29_SAI3_RX_BCLK           0x401F8088U, 0x3U, 0x401F8470U, 0x1U, 0x401F81FCU
#define IOMUXC_GPIO_EMC_29_WDOG2_RST_B_DEB        0x401F8088U, 0x4U, 0, 0, 0x401F81FCU
#define IOMUXC_GPIO_EMC_29_GPIO2_IO29             0x401F8088U, 0x5U, 0, 0, 0x401F81FCU
#define IOMUXC_GPIO_EMC_29_GPT2_COMPARE2          0x401F8088U, 0x6U, 0, 0, 0x401F81FCU
#define IOMUXC_GPIO_EMC_29_FLEXPWM1_PWMX01        0x401F8088U, 0x7U, 0, 0, 0x401F81FCU

#define IOMUXC_GPIO_EMC_30_SEMC_CLK               0x401F808CU, 0x0U, 0, 0, 0x401F8200U
#define IOMUXC_GPIO_EMC_30_FLEXPWM2_PWMA02        0x401F808CU, 0x1U, 0x401F8350U, 0x1U, 0x401F8200U
#define IOMUXC_GPIO_EMC_30_LPUART4_CTS_B          0x401F808CU, 0x2U, 0x401F83E0U, 0x1U, 0x401F8200U
#define IOMUXC_GPIO_EMC_30_SAI3_RX_SYNC           0x401F808CU, 0x3U, 0x401F8478U, 0x1U, 0x401F8200U
#define IOMUXC_GPIO_EMC_30_WDOG1_RST_B_DEB        0x401F808CU, 0x4U, 0, 0, 0x401F8200U
#define IOMUXC_GPIO_EMC_30_GPIO2_IO30             0x401F808CU, 0x5U, 0, 0, 0x401F8200U
#define IOMUXC_GPIO_EMC_30_GPT2_COMPARE3          0x401F808CU, 0x6U, 0, 0, 0x401F8200U
#define IOMUXC_GPIO_EMC_30_FLEXPWM1_PWMX02        0x401F808CU, 0x7U, 0, 0, 0x401F8200U

