Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/iMXRT1021/fsl_iomuxc.h
#define IOMUXC_GPIO_EMC_31_SEMC_DM01              0x401F8090U, 0x0U, 0, 0, 0x401F8204U
#define IOMUXC_GPIO_EMC_31_FLEXPWM2_PWMB02        0x401F8090U, 0x1U, 0x401F8360U, 0x1U, 0x401F8204U
#define IOMUXC_GPIO_EMC_31_LPUART4_RTS_B          0x401F8090U, 0x2U, 0, 0, 0x401F8204U
#define IOMUXC_GPIO_EMC_31_SAI3_RX_DATA           0x401F8090U, 0x3U, 0x401F8474U, 0x1U, 0x401F8204U
#define IOMUXC_GPIO_EMC_31_WDOG2_B                0x401F8090U, 0x4U, 0, 0, 0x401F8204U
#define IOMUXC_GPIO_EMC_31_GPIO2_IO31             0x401F8090U, 0x5U, 0, 0, 0x401F8204U
#define IOMUXC_GPIO_EMC_31_GPT2_CLK               0x401F8090U, 0x6U, 0, 0, 0x401F8204U
#define IOMUXC_GPIO_EMC_31_FLEXPWM1_PWMX03        0x401F8090U, 0x7U, 0, 0, 0x401F8204U

#define IOMUXC_GPIO_EMC_32_SEMC_DATA08            0x401F8094U, 0x0U, 0, 0, 0x401F8208U
#define IOMUXC_GPIO_EMC_32_QTIMER1_TIMER0         0x401F8094U, 0x1U, 0x401F8410U, 0x1U, 0x401F8208U
#define IOMUXC_GPIO_EMC_32_LPUART4_TX             0x401F8094U, 0x2U, 0x401F83E8U, 0x2U, 0x401F8208U
#define IOMUXC_GPIO_EMC_32_SAI3_TX_DATA           0x401F8094U, 0x3U, 0, 0, 0x401F8208U
#define IOMUXC_GPIO_EMC_32_LPSPI4_SCK             0x401F8094U, 0x4U, 0x401F83C0U, 0x1U, 0x401F8208U
#define IOMUXC_GPIO_EMC_32_GPIO3_IO00             0x401F8094U, 0x5U, 0, 0, 0x401F8208U
#define IOMUXC_GPIO_EMC_32_REF_24M_OUT            0x401F8094U, 0x7U, 0, 0, 0x401F8208U

#define IOMUXC_GPIO_EMC_33_SEMC_DATA09            0x401F8098U, 0x0U, 0, 0, 0x401F820CU
#define IOMUXC_GPIO_EMC_33_QTIMER1_TIMER1         0x401F8098U, 0x1U, 0x401F8414U, 0x1U, 0x401F820CU
#define IOMUXC_GPIO_EMC_33_LPUART4_RX             0x401F8098U, 0x2U, 0x401F83E4U, 0x2U, 0x401F820CU
#define IOMUXC_GPIO_EMC_33_SAI3_TX_BCLK           0x401F8098U, 0x3U, 0x401F847CU, 0x1U, 0x401F820CU
#define IOMUXC_GPIO_EMC_33_LPSPI4_PCS0            0x401F8098U, 0x4U, 0x401F83BCU, 0x1U, 0x401F820CU
#define IOMUXC_GPIO_EMC_33_GPIO3_IO01             0x401F8098U, 0x5U, 0, 0, 0x401F820CU

#define IOMUXC_GPIO_EMC_34_SEMC_DATA10            0x401F809CU, 0x0U, 0, 0, 0x401F8210U
#define IOMUXC_GPIO_EMC_34_QTIMER1_TIMER2         0x401F809CU, 0x1U, 0x401F8418U, 0x1U, 0x401F8210U
#define IOMUXC_GPIO_EMC_34_LPUART7_TX             0x401F809CU, 0x2U, 0x401F8400U, 0x1U, 0x401F8210U
#define IOMUXC_GPIO_EMC_34_SAI3_TX_SYNC           0x401F809CU, 0x3U, 0x401F8480U, 0x1U, 0x401F8210U
#define IOMUXC_GPIO_EMC_34_LPSPI4_SDO             0x401F809CU, 0x4U, 0x401F83C8U, 0x1U, 0x401F8210U
#define IOMUXC_GPIO_EMC_34_GPIO3_IO02             0x401F809CU, 0x5U, 0, 0, 0x401F8210U
#define IOMUXC_GPIO_EMC_34_ENET_CRS               0x401F809CU, 0x6U, 0, 0, 0x401F8210U

#define IOMUXC_GPIO_EMC_35_SEMC_DATA11            0x401F80A0U, 0x0U, 0, 0, 0x401F8214U
#define IOMUXC_GPIO_EMC_35_QTIMER1_TIMER3         0x401F80A0U, 0x1U, 0x401F841CU, 0x1U, 0x401F8214U
#define IOMUXC_GPIO_EMC_35_LPUART7_RX             0x401F80A0U, 0x2U, 0x401F83FCU, 0x1U, 0x401F8214U
#define IOMUXC_GPIO_EMC_35_USDHC2_WP              0x401F80A0U, 0x3U, 0x401F849CU, 0x1U, 0x401F8214U
#define IOMUXC_GPIO_EMC_35_LPSPI4_SDI             0x401F80A0U, 0x4U, 0x401F83C4U, 0x1U, 0x401F8214U
#define IOMUXC_GPIO_EMC_35_GPIO3_IO03             0x401F80A0U, 0x5U, 0, 0, 0x401F8214U
#define IOMUXC_GPIO_EMC_35_ENET_COL               0x401F80A0U, 0x6U, 0, 0, 0x401F8214U

#define IOMUXC_GPIO_EMC_36_SEMC_DATA12            0x401F80A4U, 0x0U, 0, 0, 0x401F8218U
#define IOMUXC_GPIO_EMC_36_FLEXPWM2_PWMA01        0x401F80A4U, 0x1U, 0x401F834CU, 0x1U, 0x401F8218U
#define IOMUXC_GPIO_EMC_36_LPUART5_CTS_B          0x401F80A4U, 0x2U, 0, 0, 0x401F8218U
#define IOMUXC_GPIO_EMC_36_CCM_PMIC_RDY           0x401F80A4U, 0x3U, 0x401F8300U, 0x3U, 0x401F8218U
#define IOMUXC_GPIO_EMC_36_LPSPI4_PCS1            0x401F80A4U, 0x4U, 0, 0, 0x401F8218U
#define IOMUXC_GPIO_EMC_36_GPIO3_IO04             0x401F80A4U, 0x5U, 0, 0, 0x401F8218U
#define IOMUXC_GPIO_EMC_36_ENET_RX_CLK            0x401F80A4U, 0x6U, 0, 0, 0x401F8218U
#define IOMUXC_GPIO_EMC_36_USDHC1_WP              0x401F80A4U, 0x7U, 0x401F8494U, 0x4U, 0x401F8218U

#define IOMUXC_GPIO_EMC_37_SEMC_DATA13            0x401F80A8U, 0x0U, 0, 0, 0x401F821CU
#define IOMUXC_GPIO_EMC_37_FLEXPWM2_PWMB01        0x401F80A8U, 0x1U, 0x401F835CU, 0x1U, 0x401F821CU
#define IOMUXC_GPIO_EMC_37_LPUART5_RTS_B          0x401F80A8U, 0x2U, 0, 0, 0x401F821CU
#define IOMUXC_GPIO_EMC_37_MQS_RIGHT              0x401F80A8U, 0x3U, 0, 0, 0x401F821CU
#define IOMUXC_GPIO_EMC_37_LPSPI4_PCS2            0x401F80A8U, 0x4U, 0, 0, 0x401F821CU
#define IOMUXC_GPIO_EMC_37_GPIO3_IO05             0x401F80A8U, 0x5U, 0, 0, 0x401F821CU
#define IOMUXC_GPIO_EMC_37_ENET_RDATA03           0x401F80A8U, 0x6U, 0, 0, 0x401F821CU
#define IOMUXC_GPIO_EMC_37_USDHC1_VSELECT         0x401F80A8U, 0x7U, 0, 0, 0x401F821CU

#define IOMUXC_GPIO_EMC_38_SEMC_DATA14            0x401F80ACU, 0x0U, 0, 0, 0x401F8220U
#define IOMUXC_GPIO_EMC_38_FLEXPWM2_PWMA00        0x401F80ACU, 0x1U, 0x401F8348U, 0x1U, 0x401F8220U
#define IOMUXC_GPIO_EMC_38_LPUART5_TX             0x401F80ACU, 0x2U, 0x401F83F0U, 0x1U, 0x401F8220U
#define IOMUXC_GPIO_EMC_38_MQS_LEFT               0x401F80ACU, 0x3U, 0, 0, 0x401F8220U
#define IOMUXC_GPIO_EMC_38_LPSPI4_PCS3            0x401F80ACU, 0x4U, 0, 0, 0x401F8220U
#define IOMUXC_GPIO_EMC_38_GPIO3_IO06             0x401F80ACU, 0x5U, 0, 0, 0x401F8220U
#define IOMUXC_GPIO_EMC_38_ENET_RDATA02           0x401F80ACU, 0x6U, 0, 0, 0x401F8220U
#define IOMUXC_GPIO_EMC_38_USDHC1_CD_B            0x401F80ACU, 0x7U, 0x401F8490U, 0x3U, 0x401F8220U

#define IOMUXC_GPIO_EMC_39_SEMC_DATA15            0x401F80B0U, 0x0U, 0, 0, 0x401F8224U
#define IOMUXC_GPIO_EMC_39_FLEXPWM2_PWMB00        0x401F80B0U, 0x1U, 0x401F8358U, 0x1U, 0x401F8224U
#define IOMUXC_GPIO_EMC_39_LPUART5_RX             0x401F80B0U, 0x2U, 0x401F83ECU, 0x1U, 0x401F8224U
#define IOMUXC_GPIO_EMC_39_USB_OTG1_OC            0x401F80B0U, 0x3U, 0x401F848CU, 0x2U, 0x401F8224U
#define IOMUXC_GPIO_EMC_39_WDOG1_B                0x401F80B0U, 0x4U, 0, 0, 0x401F8224U
#define IOMUXC_GPIO_EMC_39_GPIO3_IO07             0x401F80B0U, 0x5U, 0, 0, 0x401F8224U
#define IOMUXC_GPIO_EMC_39_ENET_TX_ER             0x401F80B0U, 0x6U, 0, 0, 0x401F8224U
#define IOMUXC_GPIO_EMC_39_GPT1_CLK               0x401F80B0U, 0x7U, 0, 0, 0x401F8224U

