Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/iMXRT1021/fsl_iomuxc.h
#define IOMUXC_GPIO_EMC_40_SEMC_CSX00             0x401F80B4U, 0x0U, 0, 0, 0x401F8228U
#define IOMUXC_GPIO_EMC_40_XBAR1_INOUT18          0x401F80B4U, 0x1U, 0x401F84BCU, 0x1U, 0x401F8228U
#define IOMUXC_GPIO_EMC_40_SPDIF_OUT              0x401F80B4U, 0x2U, 0, 0, 0x401F8228U
#define IOMUXC_GPIO_EMC_40_USB_OTG1_ID            0x401F80B4U, 0x3U, 0x401F82FCU, 0x2U, 0x401F8228U
#define IOMUXC_GPIO_EMC_40_ENET_MDIO              0x401F80B4U, 0x4U, 0x401F8308U, 0x2U, 0x401F8228U
#define IOMUXC_GPIO_EMC_40_GPIO3_IO08             0x401F80B4U, 0x5U, 0, 0, 0x401F8228U
#define IOMUXC_GPIO_EMC_40_ENET_TDATA03           0x401F80B4U, 0x6U, 0, 0, 0x401F8228U
#define IOMUXC_GPIO_EMC_40_GPT1_COMPARE3          0x401F80B4U, 0x7U, 0, 0, 0x401F8228U

#define IOMUXC_GPIO_EMC_41_SEMC_READY             0x401F80B8U, 0x0U, 0x401F8484U, 0x1U, 0x401F822CU
#define IOMUXC_GPIO_EMC_41_XBAR1_INOUT19          0x401F80B8U, 0x1U, 0x401F84C0U, 0x1U, 0x401F822CU
#define IOMUXC_GPIO_EMC_41_SPDIF_IN               0x401F80B8U, 0x2U, 0x401F8488U, 0x1U, 0x401F822CU
#define IOMUXC_GPIO_EMC_41_USB_OTG1_PWR           0x401F80B8U, 0x3U, 0, 0, 0x401F822CU
#define IOMUXC_GPIO_EMC_41_ENET_MDC               0x401F80B8U, 0x4U, 0, 0, 0x401F822CU
#define IOMUXC_GPIO_EMC_41_GPIO3_IO09             0x401F80B8U, 0x5U, 0, 0, 0x401F822CU
#define IOMUXC_GPIO_EMC_41_ENET_TDATA02           0x401F80B8U, 0x6U, 0, 0, 0x401F822CU
#define IOMUXC_GPIO_EMC_41_GPT1_COMPARE2          0x401F80B8U, 0x7U, 0, 0, 0x401F822CU

#define IOMUXC_GPIO_AD_B0_00_JTAG_TMS             0x401F80BCU, 0x0U, 0, 0, 0x401F8230U
#define IOMUXC_GPIO_AD_B0_00_GPIO1_IO00           0x401F80BCU, 0x5U, 0, 0, 0x401F8230U
#define IOMUXC_GPIO_AD_B0_00_GPT1_COMPARE1        0x401F80BCU, 0x7U, 0, 0, 0x401F8230U

#define IOMUXC_GPIO_AD_B0_01_JTAG_TCK             0x401F80C0U, 0x0U, 0, 0, 0x401F8234U
#define IOMUXC_GPIO_AD_B0_01_GPIO1_IO01           0x401F80C0U, 0x5U, 0, 0, 0x401F8234U
#define IOMUXC_GPIO_AD_B0_01_GPT1_CAPTURE2        0x401F80C0U, 0x7U, 0, 0, 0x401F8234U

#define IOMUXC_GPIO_AD_B0_02_JTAG_MOD             0x401F80C4U, 0x0U, 0, 0, 0x401F8238U
#define IOMUXC_GPIO_AD_B0_02_GPIO1_IO02           0x401F80C4U, 0x5U, 0, 0, 0x401F8238U
#define IOMUXC_GPIO_AD_B0_02_GPT1_CAPTURE1        0x401F80C4U, 0x7U, 0, 0, 0x401F8238U

#define IOMUXC_GPIO_AD_B0_03_JTAG_TDI             0x401F80C8U, 0x0U, 0, 0, 0x401F823CU
#define IOMUXC_GPIO_AD_B0_03_USDHC2_CD_B          0x401F80C8U, 0x1U, 0x401F8498U, 0x1U, 0x401F823CU
#define IOMUXC_GPIO_AD_B0_03_WDOG1_B              0x401F80C8U, 0x2U, 0, 0, 0x401F823CU
#define IOMUXC_GPIO_AD_B0_03_SAI1_MCLK            0x401F80C8U, 0x3U, 0x401F8430U, 0x1U, 0x401F823CU
#define IOMUXC_GPIO_AD_B0_03_USDHC1_WP            0x401F80C8U, 0x4U, 0x401F8494U, 0x0U, 0x401F823CU
#define IOMUXC_GPIO_AD_B0_03_GPIO1_IO03           0x401F80C8U, 0x5U, 0, 0, 0x401F823CU
#define IOMUXC_GPIO_AD_B0_03_USB_OTG1_OC          0x401F80C8U, 0x6U, 0x401F848CU, 0x0U, 0x401F823CU
#define IOMUXC_GPIO_AD_B0_03_CCM_PMIC_RDY         0x401F80C8U, 0x7U, 0x401F8300U, 0x2U, 0x401F823CU

#define IOMUXC_GPIO_AD_B0_04_JTAG_TDO             0x401F80CCU, 0x0U, 0, 0, 0x401F8240U
#define IOMUXC_GPIO_AD_B0_04_FLEXCAN1_TX          0x401F80CCU, 0x1U, 0, 0, 0x401F8240U
#define IOMUXC_GPIO_AD_B0_04_USDHC1_WP            0x401F80CCU, 0x2U, 0x401F8494U, 0x1U, 0x401F8240U
#define IOMUXC_GPIO_AD_B0_04_QTIMER2_TIMER0       0x401F80CCU, 0x3U, 0x401F8420U, 0x1U, 0x401F8240U
#define IOMUXC_GPIO_AD_B0_04_ENET_MDIO            0x401F80CCU, 0x4U, 0x401F8308U, 0x1U, 0x401F8240U
#define IOMUXC_GPIO_AD_B0_04_GPIO1_IO04           0x401F80CCU, 0x5U, 0, 0, 0x401F8240U
#define IOMUXC_GPIO_AD_B0_04_USB_OTG1_PWR         0x401F80CCU, 0x6U, 0, 0, 0x401F8240U
#define IOMUXC_GPIO_AD_B0_04_EWM_OUT_B            0x401F80CCU, 0x7U, 0, 0, 0x401F8240U

#define IOMUXC_GPIO_AD_B0_05_JTAG_TRSTB           0x401F80D0U, 0x0U, 0, 0, 0x401F8244U
#define IOMUXC_GPIO_AD_B0_05_FLEXCAN1_RX          0x401F80D0U, 0x1U, 0x401F8320U, 0x2U, 0x401F8244U
#define IOMUXC_GPIO_AD_B0_05_USDHC1_CD_B          0x401F80D0U, 0x2U, 0x401F8490U, 0x1U, 0x401F8244U
#define IOMUXC_GPIO_AD_B0_05_QTIMER2_TIMER1       0x401F80D0U, 0x3U, 0x401F8424U, 0x1U, 0x401F8244U
#define IOMUXC_GPIO_AD_B0_05_ENET_MDC             0x401F80D0U, 0x4U, 0, 0, 0x401F8244U
#define IOMUXC_GPIO_AD_B0_05_GPIO1_IO05           0x401F80D0U, 0x5U, 0, 0, 0x401F8244U
#define IOMUXC_GPIO_AD_B0_05_USB_OTG1_ID          0x401F80D0U, 0x6U, 0x401F82FCU, 0x0U, 0x401F8244U
#define IOMUXC_GPIO_AD_B0_05_NMI_GLUE_NMI         0x401F80D0U, 0x7U, 0x401F840CU, 0x0U, 0x401F8244U

#define IOMUXC_GPIO_AD_B0_06_PIT_TRIGGER00        0x401F80D4U, 0x0U, 0, 0, 0x401F8248U
#define IOMUXC_GPIO_AD_B0_06_MQS_RIGHT            0x401F80D4U, 0x1U, 0, 0, 0x401F8248U
#define IOMUXC_GPIO_AD_B0_06_LPUART1_TX           0x401F80D4U, 0x2U, 0, 0, 0x401F8248U
#define IOMUXC_GPIO_AD_B0_06_QTIMER2_TIMER2       0x401F80D4U, 0x3U, 0x401F8428U, 0x1U, 0x401F8248U
#define IOMUXC_GPIO_AD_B0_06_FLEXPWM2_PWMA03      0x401F80D4U, 0x4U, 0x401F8354U, 0x0U, 0x401F8248U
#define IOMUXC_GPIO_AD_B0_06_GPIO1_IO06           0x401F80D4U, 0x5U, 0, 0, 0x401F8248U
#define IOMUXC_GPIO_AD_B0_06_REF_32K_OUT          0x401F80D4U, 0x6U, 0, 0, 0x401F8248U

#define IOMUXC_GPIO_AD_B0_07_PIT_TRIGGER01        0x401F80D8U, 0x0U, 0, 0, 0x401F824CU
#define IOMUXC_GPIO_AD_B0_07_MQS_LEFT             0x401F80D8U, 0x1U, 0, 0, 0x401F824CU
#define IOMUXC_GPIO_AD_B0_07_LPUART1_RX           0x401F80D8U, 0x2U, 0, 0, 0x401F824CU
#define IOMUXC_GPIO_AD_B0_07_QTIMER2_TIMER3       0x401F80D8U, 0x3U, 0x401F842CU, 0x1U, 0x401F824CU
#define IOMUXC_GPIO_AD_B0_07_FLEXPWM2_PWMB03      0x401F80D8U, 0x4U, 0x401F8364U, 0x0U, 0x401F824CU
#define IOMUXC_GPIO_AD_B0_07_GPIO1_IO07           0x401F80D8U, 0x5U, 0, 0, 0x401F824CU
#define IOMUXC_GPIO_AD_B0_07_REF_24M_OUT          0x401F80D8U, 0x6U, 0, 0, 0x401F824CU

#define IOMUXC_GPIO_AD_B0_08_ENET_TX_CLK          0x401F80DCU, 0x0U, 0x401F831CU, 0x1U, 0x401F8250U
#define IOMUXC_GPIO_AD_B0_08_LPI2C3_SCL           0x401F80DCU, 0x1U, 0x401F838CU, 0x1U, 0x401F8250U
#define IOMUXC_GPIO_AD_B0_08_LPUART1_CTS_B        0x401F80DCU, 0x2U, 0, 0, 0x401F8250U
#define IOMUXC_GPIO_AD_B0_08_KPP_COL00            0x401F80DCU, 0x3U, 0, 0, 0x401F8250U
#define IOMUXC_GPIO_AD_B0_08_ENET_REF_CLK1        0x401F80DCU, 0x4U, 0x401F8304U, 0x1U, 0x401F8250U
#define IOMUXC_GPIO_AD_B0_08_GPIO1_IO08           0x401F80DCU, 0x5U, 0, 0, 0x401F8250U
#define IOMUXC_GPIO_AD_B0_08_ARM_CM7_TXEV         0x401F80DCU, 0x6U, 0, 0, 0x401F8250U

#define IOMUXC_GPIO_AD_B0_09_ENET_RDATA01         0x401F80E0U, 0x0U, 0x401F8310U, 0x1U, 0x401F8254U
#define IOMUXC_GPIO_AD_B0_09_LPI2C3_SDA           0x401F80E0U, 0x1U, 0x401F8390U, 0x1U, 0x401F8254U
#define IOMUXC_GPIO_AD_B0_09_LPUART1_RTS_B        0x401F80E0U, 0x2U, 0, 0, 0x401F8254U
#define IOMUXC_GPIO_AD_B0_09_KPP_ROW00            0x401F80E0U, 0x3U, 0, 0, 0x401F8254U
#define IOMUXC_GPIO_AD_B0_09_GPIO1_IO09           0x401F80E0U, 0x5U, 0, 0, 0x401F8254U
#define IOMUXC_GPIO_AD_B0_09_ARM_CM7_RXEV         0x401F80E0U, 0x6U, 0, 0, 0x401F8254U

#define IOMUXC_GPIO_AD_B0_10_ENET_RDATA00         0x401F80E4U, 0x0U, 0x401F830CU, 0x1U, 0x401F8258U
#define IOMUXC_GPIO_AD_B0_10_LPSPI1_SCK           0x401F80E4U, 0x1U, 0x401F83A0U, 0x1U, 0x401F8258U
#define IOMUXC_GPIO_AD_B0_10_LPUART5_TX           0x401F80E4U, 0x2U, 0x401F83F0U, 0x0U, 0x401F8258U
#define IOMUXC_GPIO_AD_B0_10_KPP_COL01            0x401F80E4U, 0x3U, 0, 0, 0x401F8258U
#define IOMUXC_GPIO_AD_B0_10_FLEXPWM2_PWMA02      0x401F80E4U, 0x4U, 0x401F8350U, 0x0U, 0x401F8258U
#define IOMUXC_GPIO_AD_B0_10_GPIO1_IO10           0x401F80E4U, 0x5U, 0, 0, 0x401F8258U
#define IOMUXC_GPIO_AD_B0_10_ARM_CM7_TRACE_CLK    0x401F80E4U, 0x6U, 0, 0, 0x401F8258U

#define IOMUXC_GPIO_AD_B0_11_ENET_RX_EN           0x401F80E8U, 0x0U, 0x401F8314U, 0x1U, 0x401F825CU
#define IOMUXC_GPIO_AD_B0_11_LPSPI1_PCS0          0x401F80E8U, 0x1U, 0x401F839CU, 0x1U, 0x401F825CU
#define IOMUXC_GPIO_AD_B0_11_LPUART5_RX           0x401F80E8U, 0x2U, 0x401F83ECU, 0x0U, 0x401F825CU
#define IOMUXC_GPIO_AD_B0_11_KPP_ROW01            0x401F80E8U, 0x3U, 0, 0, 0x401F825CU
#define IOMUXC_GPIO_AD_B0_11_FLEXPWM2_PWMB02      0x401F80E8U, 0x4U, 0x401F8360U, 0x0U, 0x401F825CU
#define IOMUXC_GPIO_AD_B0_11_GPIO1_IO11           0x401F80E8U, 0x5U, 0, 0, 0x401F825CU
#define IOMUXC_GPIO_AD_B0_11_ARM_CM7_TRACE_SWO    0x401F80E8U, 0x6U, 0, 0, 0x401F825CU

