Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/iMXRT1021/fsl_iomuxc.h
#define IOMUXC_GPIO_AD_B0_12_ENET_RX_ER           0x401F80ECU, 0x0U, 0x401F8318U, 0x1U, 0x401F8260U
#define IOMUXC_GPIO_AD_B0_12_LPSPI1_SDO           0x401F80ECU, 0x1U, 0x401F83A8U, 0x1U, 0x401F8260U
#define IOMUXC_GPIO_AD_B0_12_LPUART3_CTS_B        0x401F80ECU, 0x2U, 0, 0, 0x401F8260U
#define IOMUXC_GPIO_AD_B0_12_KPP_COL02            0x401F80ECU, 0x3U, 0, 0, 0x401F8260U
#define IOMUXC_GPIO_AD_B0_12_FLEXPWM2_PWMA01      0x401F80ECU, 0x4U, 0x401F834CU, 0x0U, 0x401F8260U
#define IOMUXC_GPIO_AD_B0_12_GPIO1_IO12           0x401F80ECU, 0x5U, 0, 0, 0x401F8260U
#define IOMUXC_GPIO_AD_B0_12_ARM_CM7_TRACE00      0x401F80ECU, 0x6U, 0, 0, 0x401F8260U
#define IOMUXC_GPIO_AD_B0_12_SNVS_HP_VIO_5_CTL    0x401F80ECU, 0x7U, 0, 0, 0x401F8260U

#define IOMUXC_GPIO_AD_B0_13_ENET_TX_EN           0x401F80F0U, 0x0U, 0, 0, 0x401F8264U
#define IOMUXC_GPIO_AD_B0_13_LPSPI1_SDI           0x401F80F0U, 0x1U, 0x401F83A4U, 0x1U, 0x401F8264U
#define IOMUXC_GPIO_AD_B0_13_LPUART3_RTS_B        0x401F80F0U, 0x2U, 0, 0, 0x401F8264U
#define IOMUXC_GPIO_AD_B0_13_KPP_ROW02            0x401F80F0U, 0x3U, 0, 0, 0x401F8264U
#define IOMUXC_GPIO_AD_B0_13_FLEXPWM2_PWMB01      0x401F80F0U, 0x4U, 0x401F835CU, 0x0U, 0x401F8264U
#define IOMUXC_GPIO_AD_B0_13_GPIO1_IO13           0x401F80F0U, 0x5U, 0, 0, 0x401F8264U
#define IOMUXC_GPIO_AD_B0_13_ARM_CM7_TRACE01      0x401F80F0U, 0x6U, 0, 0, 0x401F8264U
#define IOMUXC_GPIO_AD_B0_13_SNVS_HP_VIO_5_B      0x401F80F0U, 0x7U, 0, 0, 0x401F8264U

#define IOMUXC_GPIO_AD_B0_14_ENET_TDATA00         0x401F80F4U, 0x0U, 0, 0, 0x401F8268U
#define IOMUXC_GPIO_AD_B0_14_FLEXCAN2_TX          0x401F80F4U, 0x1U, 0, 0, 0x401F8268U
#define IOMUXC_GPIO_AD_B0_14_LPUART3_TX           0x401F80F4U, 0x2U, 0x401F83DCU, 0x1U, 0x401F8268U
#define IOMUXC_GPIO_AD_B0_14_KPP_COL03            0x401F80F4U, 0x3U, 0, 0, 0x401F8268U
#define IOMUXC_GPIO_AD_B0_14_FLEXPWM2_PWMA00      0x401F80F4U, 0x4U, 0x401F8348U, 0x0U, 0x401F8268U
#define IOMUXC_GPIO_AD_B0_14_GPIO1_IO14           0x401F80F4U, 0x5U, 0, 0, 0x401F8268U
#define IOMUXC_GPIO_AD_B0_14_ARM_CM7_TRACE02      0x401F80F4U, 0x6U, 0, 0, 0x401F8268U
#define IOMUXC_GPIO_AD_B0_14_WDOG1_ANY            0x401F80F4U, 0x7U, 0, 0, 0x401F8268U

#define IOMUXC_GPIO_AD_B0_15_ENET_TDATA01         0x401F80F8U, 0x0U, 0, 0, 0x401F826CU
#define IOMUXC_GPIO_AD_B0_15_FLEXCAN2_RX          0x401F80F8U, 0x1U, 0x401F8324U, 0x2U, 0x401F826CU
#define IOMUXC_GPIO_AD_B0_15_LPUART3_RX           0x401F80F8U, 0x2U, 0x401F83D8U, 0x1U, 0x401F826CU
#define IOMUXC_GPIO_AD_B0_15_KPP_ROW03            0x401F80F8U, 0x3U, 0, 0, 0x401F826CU
#define IOMUXC_GPIO_AD_B0_15_FLEXPWM2_PWMB00      0x401F80F8U, 0x4U, 0x401F8358U, 0x0U, 0x401F826CU
#define IOMUXC_GPIO_AD_B0_15_GPIO1_IO15           0x401F80F8U, 0x5U, 0, 0, 0x401F826CU
#define IOMUXC_GPIO_AD_B0_15_ARM_CM7_TRACE03      0x401F80F8U, 0x6U, 0, 0, 0x401F826CU

#define IOMUXC_GPIO_AD_B1_00_SEMC_READY           0x401F80FCU, 0x0U, 0x401F8484U, 0x0U, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_00_FLEXSPI_A_DATA03     0x401F80FCU, 0x1U, 0x401F8374U, 0x1U, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_00_FLEXCAN2_TX          0x401F80FCU, 0x2U, 0, 0, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_00_SAI1_MCLK            0x401F80FCU, 0x3U, 0x401F8430U, 0x2U, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_00_FLEXIO1_FLEXIO15     0x401F80FCU, 0x4U, 0, 0, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_00_GPIO1_IO16           0x401F80FCU, 0x5U, 0, 0, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_00_ENET_1588_EVENT2_OUT 0x401F80FCU, 0x6U, 0, 0, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_00_KPP_COL04            0x401F80FCU, 0x7U, 0, 0, 0x401F8270U

#define IOMUXC_GPIO_AD_B1_01_SEMC_CSX00           0x401F8100U, 0x0U, 0, 0, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_01_FLEXSPI_A_SCLK       0x401F8100U, 0x1U, 0x401F8378U, 0x1U, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_01_FLEXCAN2_RX          0x401F8100U, 0x2U, 0x401F8324U, 0x3U, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_01_SAI1_TX_BCLK         0x401F8100U, 0x3U, 0x401F844CU, 0x1U, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_01_FLEXIO1_FLEXIO14     0x401F8100U, 0x4U, 0, 0, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_01_GPIO1_IO17           0x401F8100U, 0x5U, 0, 0, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_01_ENET_1588_EVENT2_IN  0x401F8100U, 0x6U, 0, 0, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_01_KPP_ROW04            0x401F8100U, 0x7U, 0, 0, 0x401F8274U

#define IOMUXC_GPIO_AD_B1_02_SEMC_CSX01           0x401F8104U, 0x0U, 0, 0, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_02_FLEXSPI_A_DATA00     0x401F8104U, 0x1U, 0x401F8368U, 0x1U, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_02_LPSPI4_SCK           0x401F8104U, 0x2U, 0x401F83C0U, 0x0U, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_02_SAI1_TX_SYNC         0x401F8104U, 0x3U, 0x401F8450U, 0x1U, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_02_FLEXIO1_FLEXIO13     0x401F8104U, 0x4U, 0, 0, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_02_GPIO1_IO18           0x401F8104U, 0x5U, 0, 0, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_02_ENET_1588_EVENT3_OUT 0x401F8104U, 0x6U, 0, 0, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_02_KPP_COL05            0x401F8104U, 0x7U, 0, 0, 0x401F8278U

#define IOMUXC_GPIO_AD_B1_03_SEMC_CSX02           0x401F8108U, 0x0U, 0, 0, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_03_FLEXSPI_A_DATA02     0x401F8108U, 0x1U, 0x401F8370U, 0x1U, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_03_LPSPI4_PCS0          0x401F8108U, 0x2U, 0x401F83BCU, 0x0U, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_03_SAI1_TX_DATA00       0x401F8108U, 0x3U, 0, 0, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_03_FLEXIO1_FLEXIO12     0x401F8108U, 0x4U, 0, 0, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_03_GPIO1_IO19           0x401F8108U, 0x5U, 0, 0, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_03_ENET_1588_EVENT3_IN  0x401F8108U, 0x6U, 0, 0, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_03_KPP_ROW05            0x401F8108U, 0x7U, 0, 0, 0x401F827CU

#define IOMUXC_GPIO_AD_B1_04_SEMC_CSX03           0x401F810CU, 0x0U, 0, 0, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_04_FLEXSPI_A_DATA01     0x401F810CU, 0x1U, 0x401F836CU, 0x1U, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_04_LPSPI4_SDO           0x401F810CU, 0x2U, 0x401F83C8U, 0x0U, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_04_SAI1_RX_SYNC         0x401F810CU, 0x3U, 0x401F8448U, 0x0U, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_04_FLEXIO1_FLEXIO11     0x401F810CU, 0x4U, 0, 0, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_04_GPIO1_IO20           0x401F810CU, 0x5U, 0, 0, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_04_LPSPI1_PCS1          0x401F810CU, 0x6U, 0, 0, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_04_KPP_COL06            0x401F810CU, 0x7U, 0, 0, 0x401F8280U

#define IOMUXC_GPIO_AD_B1_05_USDHC1_WP            0x401F8110U, 0x0U, 0x401F8494U, 0x2U, 0x401F8284U
#define IOMUXC_GPIO_AD_B1_05_FLEXSPI_A_SS0_B      0x401F8110U, 0x1U, 0, 0, 0x401F8284U
#define IOMUXC_GPIO_AD_B1_05_LPSPI4_SDI           0x401F8110U, 0x2U, 0x401F83C4U, 0x0U, 0x401F8284U
#define IOMUXC_GPIO_AD_B1_05_SAI1_RX_DATA00       0x401F8110U, 0x3U, 0x401F8438U, 0x1U, 0x401F8284U
#define IOMUXC_GPIO_AD_B1_05_FLEXIO1_FLEXIO10     0x401F8110U, 0x4U, 0, 0, 0x401F8284U
#define IOMUXC_GPIO_AD_B1_05_GPIO1_IO21           0x401F8110U, 0x5U, 0, 0, 0x401F8284U
#define IOMUXC_GPIO_AD_B1_05_LPSPI1_PCS2          0x401F8110U, 0x6U, 0, 0, 0x401F8284U
#define IOMUXC_GPIO_AD_B1_05_KPP_ROW06            0x401F8110U, 0x7U, 0, 0, 0x401F8284U

#define IOMUXC_GPIO_AD_B1_06_USDHC1_RESET_B       0x401F8114U, 0x0U, 0, 0, 0x401F8288U
#define IOMUXC_GPIO_AD_B1_06_FLEXPWM1_PWMA00      0x401F8114U, 0x1U, 0x401F8328U, 0x0U, 0x401F8288U
#define IOMUXC_GPIO_AD_B1_06_LPUART2_CTS_B        0x401F8114U, 0x2U, 0x401F83CCU, 0x0U, 0x401F8288U
#define IOMUXC_GPIO_AD_B1_06_SAI1_RX_BCLK         0x401F8114U, 0x3U, 0x401F8434U, 0x0U, 0x401F8288U
#define IOMUXC_GPIO_AD_B1_06_FLEXIO1_FLEXIO09     0x401F8114U, 0x4U, 0, 0, 0x401F8288U
#define IOMUXC_GPIO_AD_B1_06_GPIO1_IO22           0x401F8114U, 0x5U, 0, 0, 0x401F8288U
#define IOMUXC_GPIO_AD_B1_06_LPSPI1_PCS3          0x401F8114U, 0x6U, 0, 0, 0x401F8288U
#define IOMUXC_GPIO_AD_B1_06_KPP_COL07            0x401F8114U, 0x7U, 0, 0, 0x401F8288U

#define IOMUXC_GPIO_AD_B1_07_USDHC1_VSELECT       0x401F8118U, 0x0U, 0, 0, 0x401F828CU
#define IOMUXC_GPIO_AD_B1_07_FLEXPWM1_PWMB00      0x401F8118U, 0x1U, 0x401F8338U, 0x0U, 0x401F828CU
#define IOMUXC_GPIO_AD_B1_07_LPUART2_RTS_B        0x401F8118U, 0x2U, 0, 0, 0x401F828CU
#define IOMUXC_GPIO_AD_B1_07_SAI1_TX_DATA01       0x401F8118U, 0x3U, 0x401F8444U, 0x0U, 0x401F828CU
#define IOMUXC_GPIO_AD_B1_07_FLEXIO1_FLEXIO08     0x401F8118U, 0x4U, 0, 0, 0x401F828CU
#define IOMUXC_GPIO_AD_B1_07_GPIO1_IO23           0x401F8118U, 0x5U, 0, 0, 0x401F828CU
#define IOMUXC_GPIO_AD_B1_07_LPSPI3_PCS3          0x401F8118U, 0x6U, 0, 0, 0x401F828CU
#define IOMUXC_GPIO_AD_B1_07_KPP_ROW07            0x401F8118U, 0x7U, 0, 0, 0x401F828CU

#define IOMUXC_GPIO_AD_B1_08_LPI2C2_SCL           0x401F811CU, 0x0U, 0x401F8384U, 0x0U, 0x401F8290U
#define IOMUXC_GPIO_AD_B1_08_FLEXPWM1_PWMA01      0x401F811CU, 0x1U, 0x401F832CU, 0x0U, 0x401F8290U
#define IOMUXC_GPIO_AD_B1_08_LPUART2_TX           0x401F811CU, 0x2U, 0x401F83D4U, 0x0U, 0x401F8290U
#define IOMUXC_GPIO_AD_B1_08_SAI1_TX_DATA02       0x401F811CU, 0x3U, 0x401F8440U, 0x0U, 0x401F8290U
#define IOMUXC_GPIO_AD_B1_08_FLEXIO1_FLEXIO07     0x401F811CU, 0x4U, 0, 0, 0x401F8290U
#define IOMUXC_GPIO_AD_B1_08_GPIO1_IO24           0x401F811CU, 0x5U, 0, 0, 0x401F8290U
#define IOMUXC_GPIO_AD_B1_08_LPSPI3_PCS2          0x401F811CU, 0x6U, 0, 0, 0x401F8290U
#define IOMUXC_GPIO_AD_B1_08_XBAR1_INOUT12        0x401F811CU, 0x7U, 0x401F84B4U, 0x1U, 0x401F8290U

#define IOMUXC_GPIO_AD_B1_09_LPI2C2_SDA           0x401F8120U, 0x0U, 0x401F8388U, 0x0U, 0x401F8294U
#define IOMUXC_GPIO_AD_B1_09_FLEXPWM1_PWMB01      0x401F8120U, 0x1U, 0x401F833CU, 0x0U, 0x401F8294U
#define IOMUXC_GPIO_AD_B1_09_LPUART2_RX           0x401F8120U, 0x2U, 0x401F83D0U, 0x0U, 0x401F8294U
#define IOMUXC_GPIO_AD_B1_09_SAI1_TX_DATA03       0x401F8120U, 0x3U, 0x401F843CU, 0x0U, 0x401F8294U
#define IOMUXC_GPIO_AD_B1_09_FLEXIO1_FLEXIO06     0x401F8120U, 0x4U, 0, 0, 0x401F8294U
#define IOMUXC_GPIO_AD_B1_09_GPIO1_IO25           0x401F8120U, 0x5U, 0, 0, 0x401F8294U
#define IOMUXC_GPIO_AD_B1_09_LPSPI3_PCS1          0x401F8120U, 0x6U, 0, 0, 0x401F8294U
#define IOMUXC_GPIO_AD_B1_09_XBAR1_INOUT13        0x401F8120U, 0x7U, 0x401F84B8U, 0x1U, 0x401F8294U

