Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/iMXRT1021/fsl_iomuxc.h
#define IOMUXC_GPIO_AD_B1_10_USB_OTG1_PWR         0x401F8124U, 0x0U, 0, 0, 0x401F8298U
#define IOMUXC_GPIO_AD_B1_10_FLEXPWM1_PWMA02      0x401F8124U, 0x1U, 0x401F8330U, 0x0U, 0x401F8298U
#define IOMUXC_GPIO_AD_B1_10_LPUART4_TX           0x401F8124U, 0x2U, 0x401F83E8U, 0x1U, 0x401F8298U
#define IOMUXC_GPIO_AD_B1_10_USDHC1_CD_B          0x401F8124U, 0x3U, 0x401F8490U, 0x2U, 0x401F8298U
#define IOMUXC_GPIO_AD_B1_10_FLEXIO1_FLEXIO05     0x401F8124U, 0x4U, 0, 0, 0x401F8298U
#define IOMUXC_GPIO_AD_B1_10_GPIO1_IO26           0x401F8124U, 0x5U, 0, 0, 0x401F8298U
#define IOMUXC_GPIO_AD_B1_10_GPT2_CAPTURE1        0x401F8124U, 0x6U, 0, 0, 0x401F8298U

#define IOMUXC_GPIO_AD_B1_11_USB_OTG1_ID          0x401F8128U, 0x0U, 0x401F82FCU, 0x1U, 0x401F829CU
#define IOMUXC_GPIO_AD_B1_11_FLEXPWM1_PWMB02      0x401F8128U, 0x1U, 0x401F8340U, 0x0U, 0x401F829CU
#define IOMUXC_GPIO_AD_B1_11_LPUART4_RX           0x401F8128U, 0x2U, 0x401F83E4U, 0x1U, 0x401F829CU
#define IOMUXC_GPIO_AD_B1_11_USDHC1_WP            0x401F8128U, 0x3U, 0x401F8494U, 0x3U, 0x401F829CU
#define IOMUXC_GPIO_AD_B1_11_FLEXIO1_FLEXIO04     0x401F8128U, 0x4U, 0, 0, 0x401F829CU
#define IOMUXC_GPIO_AD_B1_11_GPIO1_IO27           0x401F8128U, 0x5U, 0, 0, 0x401F829CU
#define IOMUXC_GPIO_AD_B1_11_GPT2_COMPARE1        0x401F8128U, 0x6U, 0, 0, 0x401F829CU

#define IOMUXC_GPIO_AD_B1_12_USB_OTG1_OC          0x401F812CU, 0x0U, 0x401F848CU, 0x1U, 0x401F82A0U
#define IOMUXC_GPIO_AD_B1_12_ACMP1_OUT            0x401F812CU, 0x1U, 0, 0, 0x401F82A0U
#define IOMUXC_GPIO_AD_B1_12_LPSPI3_SCK           0x401F812CU, 0x2U, 0, 0, 0x401F82A0U
#define IOMUXC_GPIO_AD_B1_12_USDHC2_CD_B          0x401F812CU, 0x3U, 0x401F8498U, 0x2U, 0x401F82A0U
#define IOMUXC_GPIO_AD_B1_12_FLEXIO1_FLEXIO03     0x401F812CU, 0x4U, 0, 0, 0x401F82A0U
#define IOMUXC_GPIO_AD_B1_12_GPIO1_IO28           0x401F812CU, 0x5U, 0, 0, 0x401F82A0U
#define IOMUXC_GPIO_AD_B1_12_FLEXPWM1_PWMA03      0x401F812CU, 0x6U, 0x401F8334U, 0x0U, 0x401F82A0U

#define IOMUXC_GPIO_AD_B1_13_LPI2C1_HREQ          0x401F8130U, 0x0U, 0, 0, 0x401F82A4U
#define IOMUXC_GPIO_AD_B1_13_ACMP2_OUT            0x401F8130U, 0x1U, 0, 0, 0x401F82A4U
#define IOMUXC_GPIO_AD_B1_13_LPSPI3_PCS0          0x401F8130U, 0x2U, 0, 0, 0x401F82A4U
#define IOMUXC_GPIO_AD_B1_13_USDHC2_WP            0x401F8130U, 0x3U, 0x401F849CU, 0x0U, 0x401F82A4U
#define IOMUXC_GPIO_AD_B1_13_FLEXIO1_FLEXIO02     0x401F8130U, 0x4U, 0, 0, 0x401F82A4U
#define IOMUXC_GPIO_AD_B1_13_GPIO1_IO29           0x401F8130U, 0x5U, 0, 0, 0x401F82A4U
#define IOMUXC_GPIO_AD_B1_13_FLEXPWM1_PWMB03      0x401F8130U, 0x6U, 0x401F8344U, 0x0U, 0x401F82A4U

#define IOMUXC_GPIO_AD_B1_14_LPI2C1_SCL           0x401F8134U, 0x0U, 0x401F837CU, 0x1U, 0x401F82A8U
#define IOMUXC_GPIO_AD_B1_14_ACMP3_OUT            0x401F8134U, 0x1U, 0, 0, 0x401F82A8U
#define IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO           0x401F8134U, 0x2U, 0, 0, 0x401F82A8U
#define IOMUXC_GPIO_AD_B1_14_ENET_1588_EVENT0_OUT 0x401F8134U, 0x3U, 0, 0, 0x401F82A8U
#define IOMUXC_GPIO_AD_B1_14_FLEXIO1_FLEXIO01     0x401F8134U, 0x4U, 0, 0, 0x401F82A8U
#define IOMUXC_GPIO_AD_B1_14_GPIO1_IO30           0x401F8134U, 0x5U, 0, 0, 0x401F82A8U

#define IOMUXC_GPIO_AD_B1_15_LPI2C1_SDA           0x401F8138U, 0x0U, 0x401F8380U, 0x1U, 0x401F82ACU
#define IOMUXC_GPIO_AD_B1_15_ACMP4_OUT            0x401F8138U, 0x1U, 0, 0, 0x401F82ACU
#define IOMUXC_GPIO_AD_B1_15_LPSPI3_SDI           0x401F8138U, 0x2U, 0, 0, 0x401F82ACU
#define IOMUXC_GPIO_AD_B1_15_ENET_1588_EVENT0_IN  0x401F8138U, 0x3U, 0, 0, 0x401F82ACU
#define IOMUXC_GPIO_AD_B1_15_FLEXIO1_FLEXIO00     0x401F8138U, 0x4U, 0, 0, 0x401F82ACU
#define IOMUXC_GPIO_AD_B1_15_GPIO1_IO31           0x401F8138U, 0x5U, 0, 0, 0x401F82ACU

#define IOMUXC_GPIO_SD_B0_00_USDHC1_DATA2         0x401F813CU, 0x0U, 0, 0, 0x401F82B0U
#define IOMUXC_GPIO_SD_B0_00_QTIMER1_TIMER0       0x401F813CU, 0x1U, 0x401F8410U, 0x0U, 0x401F82B0U
#define IOMUXC_GPIO_SD_B0_00_SAI1_MCLK            0x401F813CU, 0x2U, 0x401F8430U, 0x0U, 0x401F82B0U
#define IOMUXC_GPIO_SD_B0_00_SAI2_MCLK            0x401F813CU, 0x3U, 0x401F8454U, 0x0U, 0x401F82B0U
#define IOMUXC_GPIO_SD_B0_00_LPI2C3_SCL           0x401F813CU, 0x4U, 0x401F838CU, 0x0U, 0x401F82B0U
#define IOMUXC_GPIO_SD_B0_00_GPIO3_IO13           0x401F813CU, 0x5U, 0, 0, 0x401F82B0U
#define IOMUXC_GPIO_SD_B0_00_FLEXSPI_A_SS1_B      0x401F813CU, 0x6U, 0, 0, 0x401F82B0U
#define IOMUXC_GPIO_SD_B0_00_XBAR1_INOUT14        0x401F813CU, 0x7U, 0x401F84A0U, 0x0U, 0x401F82B0U

#define IOMUXC_GPIO_SD_B0_01_USDHC1_DATA3         0x401F8140U, 0x0U, 0, 0, 0x401F82B4U
#define IOMUXC_GPIO_SD_B0_01_QTIMER1_TIMER1       0x401F8140U, 0x1U, 0x401F8414U, 0x0U, 0x401F82B4U
#define IOMUXC_GPIO_SD_B0_01_REF_24M_OUT          0x401F8140U, 0x2U, 0, 0, 0x401F82B4U
#define IOMUXC_GPIO_SD_B0_01_SAI2_RX_SYNC         0x401F8140U, 0x3U, 0x401F8460U, 0x0U, 0x401F82B4U
#define IOMUXC_GPIO_SD_B0_01_LPI2C3_SDA           0x401F8140U, 0x4U, 0x401F8390U, 0x0U, 0x401F82B4U
#define IOMUXC_GPIO_SD_B0_01_GPIO3_IO14           0x401F8140U, 0x5U, 0, 0, 0x401F82B4U
#define IOMUXC_GPIO_SD_B0_01_FLEXSPI_B_SS1_B      0x401F8140U, 0x6U, 0, 0, 0x401F82B4U
#define IOMUXC_GPIO_SD_B0_01_XBAR1_INOUT15        0x401F8140U, 0x7U, 0x401F84A4U, 0x0U, 0x401F82B4U

#define IOMUXC_GPIO_SD_B0_02_USDHC1_CMD           0x401F8144U, 0x0U, 0, 0, 0x401F82B8U
#define IOMUXC_GPIO_SD_B0_02_QTIMER1_TIMER2       0x401F8144U, 0x1U, 0x401F8418U, 0x0U, 0x401F82B8U
#define IOMUXC_GPIO_SD_B0_02_LPUART7_CTS_B        0x401F8144U, 0x2U, 0, 0, 0x401F82B8U
#define IOMUXC_GPIO_SD_B0_02_SAI2_RX_BCLK         0x401F8144U, 0x3U, 0x401F8458U, 0x0U, 0x401F82B8U
#define IOMUXC_GPIO_SD_B0_02_LPSPI1_SCK           0x401F8144U, 0x4U, 0x401F83A0U, 0x0U, 0x401F82B8U
#define IOMUXC_GPIO_SD_B0_02_GPIO3_IO15           0x401F8144U, 0x5U, 0, 0, 0x401F82B8U
#define IOMUXC_GPIO_SD_B0_02_ENET_MDIO            0x401F8144U, 0x6U, 0x401F8308U, 0x0U, 0x401F82B8U
#define IOMUXC_GPIO_SD_B0_02_XBAR1_INOUT16        0x401F8144U, 0x7U, 0x401F84A8U, 0x0U, 0x401F82B8U

#define IOMUXC_GPIO_SD_B0_03_USDHC1_CLK           0x401F8148U, 0x0U, 0, 0, 0x401F82BCU
#define IOMUXC_GPIO_SD_B0_03_QTIMER1_TIMER3       0x401F8148U, 0x1U, 0x401F841CU, 0x0U, 0x401F82BCU
#define IOMUXC_GPIO_SD_B0_03_LPUART7_RTS_B        0x401F8148U, 0x2U, 0, 0, 0x401F82BCU
#define IOMUXC_GPIO_SD_B0_03_SAI2_RX_DATA         0x401F8148U, 0x3U, 0x401F845CU, 0x0U, 0x401F82BCU
#define IOMUXC_GPIO_SD_B0_03_LPSPI1_PCS0          0x401F8148U, 0x4U, 0x401F839CU, 0x0U, 0x401F82BCU
#define IOMUXC_GPIO_SD_B0_03_GPIO3_IO16           0x401F8148U, 0x5U, 0, 0, 0x401F82BCU
#define IOMUXC_GPIO_SD_B0_03_ENET_MDC             0x401F8148U, 0x6U, 0, 0, 0x401F82BCU

#define IOMUXC_GPIO_SD_B0_04_USDHC1_DATA0         0x401F814CU, 0x0U, 0, 0, 0x401F82C0U
#define IOMUXC_GPIO_SD_B0_04_FLEXCAN2_TX          0x401F814CU, 0x1U, 0, 0, 0x401F82C0U
#define IOMUXC_GPIO_SD_B0_04_LPUART7_TX           0x401F814CU, 0x2U, 0x401F8400U, 0x0U, 0x401F82C0U
#define IOMUXC_GPIO_SD_B0_04_SAI2_TX_DATA         0x401F814CU, 0x3U, 0, 0, 0x401F82C0U
#define IOMUXC_GPIO_SD_B0_04_LPSPI1_SDO           0x401F814CU, 0x4U, 0x401F83A8U, 0x0U, 0x401F82C0U
#define IOMUXC_GPIO_SD_B0_04_GPIO3_IO17           0x401F814CU, 0x5U, 0, 0, 0x401F82C0U
#define IOMUXC_GPIO_SD_B0_04_FLEXSPI_B_SS0_B      0x401F814CU, 0x6U, 0, 0, 0x401F82C0U

#define IOMUXC_GPIO_SD_B0_05_USDHC1_DATA1         0x401F8150U, 0x0U, 0, 0, 0x401F82C4U
#define IOMUXC_GPIO_SD_B0_05_FLEXCAN2_RX          0x401F8150U, 0x1U, 0x401F8324U, 0x0U, 0x401F82C4U
#define IOMUXC_GPIO_SD_B0_05_LPUART7_RX           0x401F8150U, 0x2U, 0x401F83FCU, 0x0U, 0x401F82C4U
#define IOMUXC_GPIO_SD_B0_05_SAI2_TX_BCLK         0x401F8150U, 0x3U, 0x401F8464U, 0x0U, 0x401F82C4U
#define IOMUXC_GPIO_SD_B0_05_LPSPI1_SDI           0x401F8150U, 0x4U, 0x401F83A4U, 0x0U, 0x401F82C4U
#define IOMUXC_GPIO_SD_B0_05_GPIO3_IO18           0x401F8150U, 0x5U, 0, 0, 0x401F82C4U
#define IOMUXC_GPIO_SD_B0_05_FLEXSPI_B_DQS        0x401F8150U, 0x6U, 0, 0, 0x401F82C4U

#define IOMUXC_GPIO_SD_B0_06_USDHC1_CD_B          0x401F8154U, 0x0U, 0x401F8490U, 0x0U, 0x401F82C8U
#define IOMUXC_GPIO_SD_B0_06_USDHC1_RESET_B       0x401F8154U, 0x1U, 0, 0, 0x401F82C8U
#define IOMUXC_GPIO_SD_B0_06_REF_32K_OUT          0x401F8154U, 0x2U, 0, 0, 0x401F82C8U
#define IOMUXC_GPIO_SD_B0_06_SAI2_TX_SYNC         0x401F8154U, 0x3U, 0x401F8468U, 0x0U, 0x401F82C8U
#define IOMUXC_GPIO_SD_B0_06_WDOG1_B              0x401F8154U, 0x4U, 0, 0, 0x401F82C8U
#define IOMUXC_GPIO_SD_B0_06_GPIO3_IO19           0x401F8154U, 0x5U, 0, 0, 0x401F82C8U
#define IOMUXC_GPIO_SD_B0_06_XBAR1_INOUT17        0x401F8154U, 0x6U, 0x401F84ACU, 0x0U, 0x401F82C8U

