Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/iMXRT1021/fsl_iomuxc.h
#define IOMUXC_GPIO_SD_B1_00_USDHC2_DATA2         0x401F8158U, 0x0U, 0, 0, 0x401F82CCU
#define IOMUXC_GPIO_SD_B1_00_FLEXSPI_B_DATA03     0x401F8158U, 0x1U, 0, 0, 0x401F82CCU
#define IOMUXC_GPIO_SD_B1_00_LPUART6_TX           0x401F8158U, 0x2U, 0x401F83F8U, 0x1U, 0x401F82CCU
#define IOMUXC_GPIO_SD_B1_00_XBAR1_INOUT10        0x401F8158U, 0x3U, 0x401F84B0U, 0x1U, 0x401F82CCU
#define IOMUXC_GPIO_SD_B1_00_FLEXCAN1_TX          0x401F8158U, 0x4U, 0, 0, 0x401F82CCU
#define IOMUXC_GPIO_SD_B1_00_GPIO3_IO20           0x401F8158U, 0x5U, 0, 0, 0x401F82CCU

#define IOMUXC_GPIO_SD_B1_01_USDHC2_DATA3         0x401F815CU, 0x0U, 0, 0, 0x401F82D0U
#define IOMUXC_GPIO_SD_B1_01_FLEXSPI_B_SCLK       0x401F815CU, 0x1U, 0, 0, 0x401F82D0U
#define IOMUXC_GPIO_SD_B1_01_LPUART6_RX           0x401F815CU, 0x2U, 0x401F83F4U, 0x1U, 0x401F82D0U
#define IOMUXC_GPIO_SD_B1_01_FLEXSPI_A_SS1_B      0x401F815CU, 0x3U, 0, 0, 0x401F82D0U
#define IOMUXC_GPIO_SD_B1_01_FLEXCAN1_RX          0x401F815CU, 0x4U, 0x401F8320U, 0x1U, 0x401F82D0U
#define IOMUXC_GPIO_SD_B1_01_GPIO3_IO21           0x401F815CU, 0x5U, 0, 0, 0x401F82D0U

#define IOMUXC_GPIO_SD_B1_02_USDHC2_CMD           0x401F8160U, 0x0U, 0, 0, 0x401F82D4U
#define IOMUXC_GPIO_SD_B1_02_FLEXSPI_B_DATA00     0x401F8160U, 0x1U, 0, 0, 0x401F82D4U
#define IOMUXC_GPIO_SD_B1_02_LPUART8_TX           0x401F8160U, 0x2U, 0x401F8408U, 0x0U, 0x401F82D4U
#define IOMUXC_GPIO_SD_B1_02_LPI2C4_SCL           0x401F8160U, 0x3U, 0x401F8394U, 0x1U, 0x401F82D4U
#define IOMUXC_GPIO_SD_B1_02_ENET_1588_EVENT1_OUT 0x401F8160U, 0x4U, 0, 0, 0x401F82D4U
#define IOMUXC_GPIO_SD_B1_02_GPIO3_IO22           0x401F8160U, 0x5U, 0, 0, 0x401F82D4U
#define IOMUXC_GPIO_SD_B1_02_CCM_CLKO1            0x401F8160U, 0x6U, 0, 0, 0x401F82D4U

#define IOMUXC_GPIO_SD_B1_03_USDHC2_CLK           0x401F8164U, 0x0U, 0, 0, 0x401F82D8U
#define IOMUXC_GPIO_SD_B1_03_FLEXSPI_B_DATA02     0x401F8164U, 0x1U, 0, 0, 0x401F82D8U
#define IOMUXC_GPIO_SD_B1_03_LPUART8_RX           0x401F8164U, 0x2U, 0x401F8404U, 0x0U, 0x401F82D8U
#define IOMUXC_GPIO_SD_B1_03_LPI2C4_SDA           0x401F8164U, 0x3U, 0x401F8398U, 0x1U, 0x401F82D8U
#define IOMUXC_GPIO_SD_B1_03_ENET_1588_EVENT1_IN  0x401F8164U, 0x4U, 0, 0, 0x401F82D8U
#define IOMUXC_GPIO_SD_B1_03_GPIO3_IO23           0x401F8164U, 0x5U, 0, 0, 0x401F82D8U
#define IOMUXC_GPIO_SD_B1_03_CCM_CLKO2            0x401F8164U, 0x6U, 0, 0, 0x401F82D8U

#define IOMUXC_GPIO_SD_B1_04_USDHC2_DATA0         0x401F8168U, 0x0U, 0, 0, 0x401F82DCU
#define IOMUXC_GPIO_SD_B1_04_FLEXSPI_B_DATA01     0x401F8168U, 0x1U, 0, 0, 0x401F82DCU
#define IOMUXC_GPIO_SD_B1_04_ENET_TX_CLK          0x401F8168U, 0x2U, 0x401F831CU, 0x0U, 0x401F82DCU
#define IOMUXC_GPIO_SD_B1_04_ENET_REF_CLK1        0x401F8168U, 0x3U, 0x401F8304U, 0x0U, 0x401F82DCU
#define IOMUXC_GPIO_SD_B1_04_EWM_OUT_B            0x401F8168U, 0x4U, 0, 0, 0x401F82DCU
#define IOMUXC_GPIO_SD_B1_04_GPIO3_IO24           0x401F8168U, 0x5U, 0, 0, 0x401F82DCU
#define IOMUXC_GPIO_SD_B1_04_CCM_WAIT             0x401F8168U, 0x6U, 0, 0, 0x401F82DCU

#define IOMUXC_GPIO_SD_B1_05_USDHC2_DATA1         0x401F816CU, 0x0U, 0, 0, 0x401F82E0U
#define IOMUXC_GPIO_SD_B1_05_FLEXSPI_A_DQS        0x401F816CU, 0x1U, 0, 0, 0x401F82E0U
#define IOMUXC_GPIO_SD_B1_05_ENET_RDATA01         0x401F816CU, 0x2U, 0x401F8310U, 0x0U, 0x401F82E0U
#define IOMUXC_GPIO_SD_B1_05_SAI3_MCLK            0x401F816CU, 0x3U, 0x401F846CU, 0x0U, 0x401F82E0U
#define IOMUXC_GPIO_SD_B1_05_FLEXSPI_B_SS0_B      0x401F816CU, 0x4U, 0, 0, 0x401F82E0U
#define IOMUXC_GPIO_SD_B1_05_GPIO3_IO25           0x401F816CU, 0x5U, 0, 0, 0x401F82E0U
#define IOMUXC_GPIO_SD_B1_05_CCM_PMIC_RDY         0x401F816CU, 0x6U, 0x401F8300U, 0x1U, 0x401F82E0U

#define IOMUXC_GPIO_SD_B1_06_USDHC2_CD_B          0x401F8170U, 0x0U, 0x401F8498U, 0x0U, 0x401F82E4U
#define IOMUXC_GPIO_SD_B1_06_FLEXSPI_A_DATA03     0x401F8170U, 0x1U, 0x401F8374U, 0x0U, 0x401F82E4U
#define IOMUXC_GPIO_SD_B1_06_ENET_RDATA00         0x401F8170U, 0x2U, 0x401F830CU, 0x0U, 0x401F82E4U
#define IOMUXC_GPIO_SD_B1_06_SAI3_TX_BCLK         0x401F8170U, 0x3U, 0x401F847CU, 0x0U, 0x401F82E4U
#define IOMUXC_GPIO_SD_B1_06_LPSPI2_PCS0          0x401F8170U, 0x4U, 0x401F83ACU, 0x2U, 0x401F82E4U
#define IOMUXC_GPIO_SD_B1_06_GPIO3_IO26           0x401F8170U, 0x5U, 0, 0, 0x401F82E4U
#define IOMUXC_GPIO_SD_B1_06_CCM_STOP             0x401F8170U, 0x6U, 0, 0, 0x401F82E4U

#define IOMUXC_GPIO_SD_B1_07_USDHC2_RESET_B       0x401F8174U, 0x0U, 0, 0, 0x401F82E8U
#define IOMUXC_GPIO_SD_B1_07_FLEXSPI_A_SCLK       0x401F8174U, 0x1U, 0x401F8378U, 0x0U, 0x401F82E8U
#define IOMUXC_GPIO_SD_B1_07_ENET_RX_EN           0x401F8174U, 0x2U, 0x401F8314U, 0x0U, 0x401F82E8U
#define IOMUXC_GPIO_SD_B1_07_SAI3_TX_SYNC         0x401F8174U, 0x3U, 0x401F8480U, 0x0U, 0x401F82E8U
#define IOMUXC_GPIO_SD_B1_07_LPSPI2_SCK           0x401F8174U, 0x4U, 0, 0, 0x401F82E8U
#define IOMUXC_GPIO_SD_B1_07_GPIO3_IO27           0x401F8174U, 0x5U, 0, 0, 0x401F82E8U

#define IOMUXC_GPIO_SD_B1_08_USDHC2_DATA4         0x401F8178U, 0x0U, 0, 0, 0x401F82ECU
#define IOMUXC_GPIO_SD_B1_08_FLEXSPI_A_DATA00     0x401F8178U, 0x1U, 0x401F8368U, 0x0U, 0x401F82ECU
#define IOMUXC_GPIO_SD_B1_08_ENET_RX_ER           0x401F8178U, 0x2U, 0x401F8318U, 0x0U, 0x401F82ECU
#define IOMUXC_GPIO_SD_B1_08_SAI3_TX_DATA         0x401F8178U, 0x3U, 0, 0, 0x401F82ECU
#define IOMUXC_GPIO_SD_B1_08_LPSPI2_SDO           0x401F8178U, 0x4U, 0x401F83B8U, 0x2U, 0x401F82ECU
#define IOMUXC_GPIO_SD_B1_08_GPIO3_IO28           0x401F8178U, 0x5U, 0, 0, 0x401F82ECU

#define IOMUXC_GPIO_SD_B1_09_USDHC2_DATA5         0x401F817CU, 0x0U, 0, 0, 0x401F82F0U
#define IOMUXC_GPIO_SD_B1_09_FLEXSPI_A_DATA02     0x401F817CU, 0x1U, 0x401F8370U, 0x0U, 0x401F82F0U
#define IOMUXC_GPIO_SD_B1_09_ENET_TX_EN           0x401F817CU, 0x2U, 0, 0, 0x401F82F0U
#define IOMUXC_GPIO_SD_B1_09_SAI3_RX_BCLK         0x401F817CU, 0x3U, 0x401F8470U, 0x0U, 0x401F82F0U
#define IOMUXC_GPIO_SD_B1_09_LPSPI2_SDI           0x401F817CU, 0x4U, 0x401F83B4U, 0x2U, 0x401F82F0U
#define IOMUXC_GPIO_SD_B1_09_GPIO3_IO29           0x401F817CU, 0x5U, 0, 0, 0x401F82F0U

#define IOMUXC_GPIO_SD_B1_10_USDHC2_DATA6         0x401F8180U, 0x0U, 0, 0, 0x401F82F4U
#define IOMUXC_GPIO_SD_B1_10_FLEXSPI_A_DATA01     0x401F8180U, 0x1U, 0x401F836CU, 0x0U, 0x401F82F4U
#define IOMUXC_GPIO_SD_B1_10_ENET_TDATA00         0x401F8180U, 0x2U, 0, 0, 0x401F82F4U
#define IOMUXC_GPIO_SD_B1_10_SAI3_RX_SYNC         0x401F8180U, 0x3U, 0x401F8478U, 0x0U, 0x401F82F4U
#define IOMUXC_GPIO_SD_B1_10_LPSPI2_PCS2          0x401F8180U, 0x4U, 0, 0, 0x401F82F4U
#define IOMUXC_GPIO_SD_B1_10_GPIO3_IO30           0x401F8180U, 0x5U, 0, 0, 0x401F82F4U

